{
    "projeto1": {
        "src": "assets/img/projects/ListaTarefas.png",
        "alt": "Projeto Lista de Tarefas",
        "width": "80%",
        "height": "80%",
        "title": "Lista de Tarefas",
        "description": "<p>Uma lista de tarefas simples, para reconhecimento das capacidades do Angular</p>",
        "links": [
            {
                "name": "Lista de Tarefas",
                "href": "https://rbt678.github.io/ListaDeTarefas/"
            }
        ]
    },
    "projeto2": {
        "src": "assets/img/projects/ProjecaoFinanceiraHTML.png",
        "alt": "Projeto Projeção Financeira",
        "width": "80%",
        "height": "80%",
        "title": "Projeção Financeira",
        "description": "<p>Permite a adição dinâmica de valores diários ou importação via JSON, com projeção e edição mensal dos dados.</p>",
        "links": [
            {
                "name": "Projeção Financeira",
                "href": "assets/html/ProjecaoFinanceira2.html"
            }
        ]
    },
    "projeto3": {
        "src": "assets/img/projects/ProjecaoFinanceiraNextJS.png",
        "alt": "Projeto Projeção Financeira com NextJS",
        "width": "80%",
        "height": "80%",
        "title": "Projeção Financeira com NextJS",
        "description": "<p>A mesma ideia que o projeto anterior, mas agora com o poder do framwork NextJS.</p> <p>Permite a adição dinâmica de valores diários ou importação via JSON, com projeção e edição mensal dos dados.</p>",
        "links": [
            {
                "name": "Projeção Financeira",
                "href": "https://projecao-financeira.vercel.app/"
            }
        ]
    },
    "projeto4": {
        "src": "assets/img/projects/RelatorioIncidentes.png",
        "alt": "Projeto Relatório de Incidentes",
        "width": "80%",
        "height": "80%",
        "title": "Relatório de Incidentes",
        "description": "<p>Aplicação para padronizar a documentação de testes, podendo gerar e armazenar de registros em JSON, facilitando a manutenção de uma base de dados para análises futuras.</p>",
        "links": [
            {
                "name": "Relatório de Incidentes",
                "href": "assets/html/relatorioIncidentes.html"
            }
        ]
    },
    "projeto5": {
        "src": "assets/img/projects/TabelaDinamica.png",
        "alt": "Projeto Tabela Dinâmica",
        "width": "80%",
        "height": "80%",
        "title": "Tabela Dinâmica",
        "description": "<p>Permite análise, filtragem e soma automática de valores a partir de dados importados em formato JSON (dentro do HTML).</p>",
        "links": [
            {
                "name": "Tabela Dinâmica",
                "href": "assets/html/tabelaDinamica.html"
            }
        ]
    },
    "projeto6": {
        "src": "assets/img/projects/AmazonScraper.png",
        "alt": "Projeto Amazon Web Scraper",
        "width": "80%",
        "height": "80%",
        "title": "Amazon Web Scraper",
        "description": "<p>Projeto Node que faz uma raspagem de dados da Amazon, buscando produtos e preços da primeira página de resultados, salvando em um arquivo JSON e servindo uma aplicação web.</p>",
        "links": [
            {
                "name": "Amazon Web Scraper",
                "href": "https://amazon-web-scraper-indol.vercel.app/"
            }
        ]
    },
    "projeto7": {
        "src": "assets/img/projects/MenuParaFuncionario.png",
        "alt": "Projeto Menu Para Funcionarios de Restaurantes",
        "width": "80%",
        "height": "80%",
        "title": "Menu Para Funcionarios de Restaurantes",
        "description": "<p>Um aplicativo web para visualização de cardápio, montagem e gerenciamento de pedidos para o Menu para funcionários de restaurantes. Desenvolvido com React, TypeScript e Tailwind CSS, focado em uma experiência de usuário intuitiva e eficiente para o ponto de venda.</p>",
        "links": [
            {
                "name": "Menu Para Funcionarios de Restaurantes",
                "href": "https://menu-para-funcionario.vercel.app/"
            }
        ]
    },
    "projeto8": {
        "src": "assets/img/projects/SuspeitoTrackerApp.png",
        "alt": "Projeto Suspeito Tracker App",
        "width": "80%",
        "height": "80%",
        "title": "Suspeito Tracker App",
        "description": "<p>Página estática usando apenas HTML e CSS, para auxiliar no rastreamento do jogo Suspeito</p>",
        "links": [
            {
                "name": "Suspeito Tracker App",
                "href": "https://rbt678.github.io/Suspeito-Tracker-App/"
            }
        ]
    },
    "projeto9": {
        "src": "assets/img/projects/ListaDeCompras.png",
        "alt": "Projeto Lista de Compras",
        "width": "80%",
        "height": "80%",
        "title": "Lista de Compras",
        "description": "<p>Uma lista de compras simples, usando Vite e Tailwind, para reconhecimento das capacidades do Vite</p>",
        "links": [
            {
                "name": "Lista de Compras",
                "href": "https://lista-de-compras-alpha-one.vercel.app/"
            }
        ]
    },
    "projeto10": {
        "src": "assets/img/projects/CofreRapido.png",
        "alt": "Projeto Cofre Rápido",
        "width": "80%",
        "height": "80%",
        "title": "Cofre Rápido",
        "description": "<p>Este é o 'Cofre Rápido', um aplicativo de caixa (PWA - Progressive Web App) projetado para ser rápido e funcionar totalmente offline. Ele serve para ajudar operadores de caixa a gerenciar dinheiro de forma eficiente.</p><p>Suas principais funcionalidades são:</p><ul><li>Controle de Caixa Detalhado: Permite ao usuário manter um registro exato da quantidade de cada nota e moeda em sua gaveta.</li><li>Cálculo de Troco Inteligente: A principal função é a de 'Trocar Valor'. O usuário insere as notas/moedas que recebeu do cliente, e o app sugere a melhor combinação de troco a ser entregue, tentando preservar uma quantidade mínima de notas/moedas definida pelo usuário (Preferências).</li><li>Gestão de Malotes: O usuário pode criar 'malotes' (pacotes pré-definidos de moedas) para agilizar o troco. Esses malotes podem ser usados em transações ou desfeitos, retornando as moedas para a gaveta.</li><li>Movimentações Manuais: Permite registrar entradas (reforço de caixa) e saídas (sangrias) de forma detalhada.</li><li>Histórico Completo: Todas as operações são registradas com data, hora e detalhes da composição do dinheiro. É possível consultar o histórico por dia e apagar transações, ação que reverte o saldo do caixa automaticamente.</li></ul><p>Tecnicamente, ele usa o IndexedDB (através da biblioteca Dexie.js) para armazenar todos os dados no navegador, garantindo o funcionamento offline. O uso de um Service Worker o torna um PWA instalável e confiável.</p>",
        "links": [
            {
                "name": "Cofre Rápido",
                "href": "https://cofre-rapido.vercel.app/"
            }
        ]
    },
    "projeto11": {
        "src": "assets/img/projects/Escalonador.png",
        "alt": "Projeto Escalonador",
        "width": "80%",
        "height": "80%",
        "title": "Escalonador",
        "description": "<p>Este é um Agendador Simplificado, uma aplicação web construída com Angular projetada para que gestores criem e gerenciem escalas de trabalho de suas equipes. A aplicação funciona inteiramente no navegador, salvando todos os dados localmente no localStorage, sem a necessidade de um backend.</p><p>Principais Funcionalidades:</p><ul><li>Calendário Visual: A interface principal é um calendário mensal que exibe os funcionários alocados em diferentes turnos (ex: Manhã, Tarde).</li><li>Agendamentos Recorrentes: Permite criar escalas de trabalho que se repetem semanalmente, com datas de início e término opcionais.</li><li>Gerenciamento com Arrastar e Soltar: Você pode arrastar um agendamento para outro dia ou turno. Essa ação pode mover toda a série recorrente, dividi-la em duas, ou até mesmo juntar duas séries de um mesmo funcionário.</li><li>Detecção de Conflitos: A interface fornece feedback visual imediato se uma alteração criar um conflito na agenda de um funcionário.</li><li>Gestão Completa: Modais dedicados permitem gerenciar funcionários, turnos, períodos de ausência (como férias) e as regras de agendamento de cada um de forma detalhada.</li><li>Regras de Agendamento: É possível habilitar regras, como a exigência de um número mínimo de folgas semanais, para ajudar a manter a escala justa.</li></ul><p>Tecnicamente, o app utiliza recursos modernos do Angular, como componentes standalone e signals para gerenciamento de estado, e é estilizado com Tailwind CSS. A interface está em Português do Brasil.</p>",
        "links": [
            {
                "name": "Escalonador",
                "href": "https://escalonador.vercel.app/"
            }
        ]
    }
}